In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data_06.csv")

In [3]:
df

      Name  Maths  Science  English
0    Alice     85       90       88
1      Bob     78       82       85
2  Charlie     92       89       94

In [21]:
df2 = df.melt(id_vars=['Name'], value_vars=["Maths", "Science", "English"], var_name="Subject", value_name="Score")

In [22]:
df2

      Name  Subject  Score
0    Alice    Maths     85
1      Bob    Maths     78
2  Charlie    Maths     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [23]:
df2.pivot(index="Name", columns="Subject", values="Score").reset_index()

Subject     Name  English  Maths  Science
0          Alice       88     85       90
1            Bob       85     78       82
2        Charlie       94     92       89